load-test/campaigns/2026-08-07_place-skeleton-cache/scenarios/skeleton-cache-step-size10.yml
# 계단형 단일 라운드 — 워밍업 뒤 도착률을 120 → 180 → 240 → 300 → 360 → 420 → 480 /s로 30초씩 올린다.
# 사전 등록: ../README.md
#
# ⚠️ 이 파일만 `size=10`이다 — **앱 기본값**(`PlaceService.DEFAULT_PAGE_SIZE`)이 10이기 때문이다.
# 같은 디렉터리의 `skeleton-cache-step.yml`은 `size=20`이고, 그것은 2026-08-02 이후 전 캠페인이
# 물려온 값이다(이전 관측과 이어 읽기 위해 그대로 뒀다). 두 회차를 같은 캠페인에 남기는 이유는
# 버리지 않기 위해서가 아니라 **캐시 절감을 두 몫으로 가르기 위해서**다 —
#   고정 몫: 쿼리 2개의 왕복·파싱 (페이지 크기와 무관)
#   가변 몫: 엔티티·태그·이미지 객체 생성 (페이지 크기에 비례)
# size 10과 20의 절감 차이가 곧 가변 몫이다. 한 회차만으로는 이 분해를 할 수 없다.
#
# 그 밖의 요청 믹스는 2026-08-06_minimal-stability-final/scenarios/stability-300.yml과 같다.
# 믹스를 바꾸면 "부하 때문인가 믹스 때문인가"를 나눌 수 없다. 바뀌는 축은 도착률과 size뿐이다.
#
# 계단을 30초로 잡은 이유: Artillery의 중간 리포트가 10초 버킷이라 30초면 계단마다 **온전한
# 버킷 3개**가 떨어진다. 25초로 잡으면 버킷이 계단 경계를 걸쳐 구간 지연이 섞인다.
#
# phases는 단독 정의한다 — `environments`는 phase 배열을 원소 단위로 병합해 기본 프로파일이
# 잔존한다 (#381 측정 폐기 원인, 함정 목록).
config:
  target: "http://localhost:8082"
  payload:
    path: "../../../data/users.csv"
    fields:
      - token
    order: random
    skipHeader: true
  # 커서에는 필터 지문이 박혀 있다 — 2페이지에서 태그가 달라지면 서버가 400으로 거절한다.
  # 그래서 태그는 요청마다가 아니라 시나리오 단위로 고정되는 config.variables로 뽑는다.
  variables:
    subA: [7, 8, 9, 10]             # OPTION1, parent = 1
    subB: [11, 12, 13, 14, 15, 16]  # OPTION2, parent = 1
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 60
    - name: "S1-120"
      duration: 30
      arrivalRate: 120
    - name: "S2-180"
      duration: 30
      arrivalRate: 180
    - name: "S3-240"
      duration: 30
      arrivalRate: 240
    - name: "S4-300"
      duration: 30
      arrivalRate: 300
    - name: "S5-360"
      duration: 30
      arrivalRate: 360
    # S6·S7은 이 캠페인에서 새로 붙였다. 직전 캠페인의 knee가 S4→S5였으므로 360에서 끝내면
    # "360이 더 이상 knee가 아니다"까지만 보이고 knee가 **어디로 옮겨갔는지**는 못 본다.
    # 480 arrivals ≈ 744 HTTP req/s로, 캐시 적용 시 예상 천장(약 750 req/s)을 덮는다.
    - name: "S6-420"
      duration: 30
      arrivalRate: 420
    - name: "S7-480"
      duration: 30
      arrivalRate: 480
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  # ── 무태그 ────────────────────────────────────────────────────────────────
  - name: "popular-town"
    weight: 25
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 10
          name: "popular-town-p1"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "latest-town"
    weight: 15
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "LATEST"
            size: 10
          name: "latest-town-p1"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "popular-city-scroll"
    weight: 20
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 10
          name: "popular-city-p1"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "cursorPop"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 10
            cursor: "{{ cursorPop }}"
          name: "popular-city-p2"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "cursorPop"

  # ── 태그 필터 (b24185a 개선 대상 경로) ─────────────────────────────────────
  - name: "popular-city-tag3-scroll"
    weight: 25
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
          name: "popular-city-tag3-p1"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "cursorTagPop"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
            cursor: "{{ cursorTagPop }}"
          name: "popular-city-tag3-p2"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "cursorTagPop"

  - name: "latest-city-tag3-scroll"
    weight: 15
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "LATEST"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
          name: "latest-city-tag3-p1"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "cursorTagLat"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "LATEST"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
            cursor: "{{ cursorTagLat }}"
          name: "latest-city-tag3-p2"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "cursorTagLat"